/* NON_MATCHING: romwright 0.5.0 decompilation of `FUN_00100cb8` (_code @ 0x100cb8, 0x1a bytes) from smt4.cxi.
 * build.py compiles it with the retail compiler and objdiff compares it with the retail bytes: remove this marker once it matches. */
#include "romwright_types.h"

typedef int romwright_code();

void FUN_00100cb8(void)

{
  char *pcVar1;
  
  for (pcVar1 = 
       "缨￼砤￼㚘￼翌￼翴￼䞐￼Ὄ￼⾔￼囜￼ᾘ￼圬￼釰￼耀￼ꎠ￼꣨￼谠￼鈈￼饀￼ꗰ￼ꂈ￼ꘔ￼烰￼耄￼噴￼鈔￼砜￼Ἠ￼嚼￼㭀￼㭨￼䝘￼㮌￼䝼￼焘￼䖼￼葐￼껬￼㣜￼ᘌ￼꿨￼盘￼⭔￼儀￼⭸￼ᶀ￼㣨￼ⵀ￼ᙀ￼껨￼꼐￼꼸￼ꊰ￼㤤￼萴￼緸￼薄￼典￼䗤￼邰￼盤￼冔￼咨￼瞴￼䯌￼碌￼碴￼耠￼囌￼ᜤ￼嚘￼㭴￼讘￼Ỉ￼Ự￼㮐￼讴￼炘￼⺨￼㯌￼㯴￼䟠￼⻄￼嚼￼Ỵ￼Ἔ￼ὄ￼囘￼㰀￼炔￼ὠ￼㰠￼矴￼⻄￼⻬￼⼔￼ὴ￼蔌￼硠￼뀰￼ᾐ￼珬￼濜￼㪜￼䝘￼蒔￼諤￼㪸￼䑀￼茀￼꺤￼ᰠ￼佨￼侐￼嵨￼糜￼侰￼嶈￼㝰￼⥰￼⧄￼⧬￼ᒔ￼俬￼菄￼ᓠ￼ᱨ￼㢄￼憤￼䓴￼ᴈ￼⵼￼ᖠ￼ᴨ￼꽤￼㥬￼呴￼訐￼ᯠ￼䏰￼㮈￼觔￼騰￼䇼￼俰￼껠￼㢼￼珄￼臠￼穸￼䈌￼瓴￼岤￼㚸￼濨￼⺠￼㰐￼㰸￼慘￼Ꮤ￼ⱘ￼ᰈ￼Ⳕ￼ᓌ￼㡈￼⏠￼◸￼⮸￼⯠￼協￼茸￼荠￼ᾰ￼佐￼㜔￼䎸￼䏠￼瓤￼澴￼誜￼勼￼ⰰ￼爤￼⢜￼岨￼區￼ⱈ￼恠￼ᯈ￼㞸￼䐬￼愀￼㠰￼까￼瓸￼⮠￼㡌￼籰￼ⅸ￼蛨￼궔￼爰￼┼￼㪸￼㱰￼堤￼碌￼⸐￼꺨￼㲈￼䦰￼㳸￼㴠￼Ⅸ￼䧌￼だ￼ᙤ￼㴸￼む￼ダ￼껜￼ⅴ￼堌￼↘￼⇀￼ᙬ￼ᚬ￼㵸￼ム￼䦼￼㄄￼ᛜ￼ㅀ￼㶌￼∀￼∨￼墤￼ㆰ￼硤￼㇔￼焐￼碄￼㷴￼墴￼砠￼䦨￼䧐￼䧸￼塈￼笜￼尠￼風￼鏬￼Ꙙ￼麜￼鐌￼ꤰ￼薐￼㶈￼ㄬ￼᫔￼彤￼ㆤ￼墐￼㹔￼ᝨ￼ថ￼⋸￼㹰￼ዸ￼䌘￼琜￼䫐￼虐￼讴￼诜￼烘￼垨￼墀￼ㆸ￼㺘￼㇜￼㺼￼墘￼ꯀ￼ꫠ￼䬐￼墴￼䬴￼㻌￼귰￼ዸ￼水￼汜￼䋤￼⦌￼ꪈ￼㿬￼窰￼厴￼㦤￼㫀￼䥈￼濨￼䧌￼ㄤ￼冈￼⏰￼妀￼䬌￼㼄￼ጀ￼䍌￼加￼篨￼ᴐ￼ᶜ￼緀￼鰌￼洨￼膼￼呄￼趜￼呼￼緐￼㤔￼䒌￼蠠￼Ḡ￼啀￼涀￼᎐￼蹄￼㨜￼Ậ￼漼￼㳔￼≤￼㸴￼迠￼麴￼䑼￼醌￼裸￼痐￼꒬￼闀￼繘￼鰨￼灤￼蕈￼꟠￼ꏼ￼蠐￼ꠀ￼꠨￼ꇌ￼ꢨ￼ꥤ￼ꆔ￼꣈￼萜￼蘈￼⒈￼煴￼磈￼ㆰ￼姸￼灼￼ꁌ￼⬘￼ᙄ￼ᜀ￼མ￼㉨￼炌￼⌜￼纤￼␠￼Ꭼ￼᜼￼䪐￼薌￼譴￼相￼烴￼㊐￼㊸￼㋠￼㾰￼ᝬ￼㽼￼ຘ￼྘￼眸￼ᘐ￼䧜￼蓸￼誸￼པ￼࿤￼⒰￼㺠￼䪰￼墈￼㇀￼㈔￼ぴ￼ᛸ￼瀰￼䩨￼㺨￼灜￼㹈￼場￼᜴￼ꬨ￼礬￼阸￼陠￼秼￼䈌￼ꇸ￼䈰￼凬￼笸￼箴￼虤￼篘￼刐￼謐￼⹐￼\x200c￼䝨￼‰￼䊬￼谀￼ꏐ￼蠐￼䍜￼芈￼ᴬ￼璘￼鰨￼浐￼㫴￼茸￼ᾤ￼颠￼疄￼䝐￼䟰￼麴￼酸￼鱔￼醄￼醔￼䠘￼釜￼褨￼₠￼圈￼↰￼槠￼誴￼陔￼ꅴ￼虴￼耜￼獘￼駘￼簈￼ꁔ￼聄￼᱀￼跼￼聤￼ꒄ￼鉨￼雬￼踤￼ꎔ￼殌￼簌￼㞄￼ꉀ￼靈￼ꔜ￼軌￼꛰￼鵼￼騘￼ꏐ￼胬￼脔￼轼￼辤￼ꔰ￼还￼脴￼靌￼殨￼毐￼勠￼簼￼韨￼鐬￼苼￼꤈￼茌￼冼￼爬￼᫨￼ᬐ￼謔￼刬￼绘￼竸￼牨￼醘￼謨￼绰￼笐￼ὐ￼Ꮄ￼茤￼逨￼莠￼鏼￼㴨￼鄔￼簐￼㳰￼ᒬ￼乨￼熸￼ᤄ￼磴￼僌￼魀￼齰￼胈￼龔￼殔￼独￼鋠￼ꃈ￼珨￼龨￼꘼￼鳔￼鋴￼筐￼錘￼蛰￼蜘￼浄￼鴤￼啰￼ꈔ￼鮀￼鷐￼㘐￼樔￼鯬￼赬￼蔤￼闈￼酸￼醰￼缘￼趼￼蔸￼罈￼薈￼飴￼釬￼薨￼ꊴ￼阼￼ꓸ￼饄￼鿠￼鷨￼䃬￼樬￼醘￼罈￼兠￼熤￼燌￼牰￼冨￼辨￼ⴤ￼獨￼⇐￼傌￼烼￼傰￼༄￼༬￼ᷨ￼᡼￼㿠￼侬￼㿬￼ᢸ￼间￼ꊰ￼䃜￼胜￼鷸￼躠￼ꀐ￼ꋰ￼ꃘ￼鯴￼鉀￼綔￼鞼￼谤￼豔￼ꆘ￼鴈￼顨￼樌￼鬬￼毜￼轜￼咤￼鮄￼儜￼饜￼ꉸ￼鹸￼❈￼"
      ; (int *)pcVar1 != (int *)0x42ab78; unique0x10000039 = (int)pcVar1 + 4) {
    (*(romwright_code *)(*(int *)pcVar1 + (int)pcVar1))();
    pcVar1 = (char *)((int)pcVar1 + 4);
  }
  return;
}
