/* NON_MATCHING: romwright 0.5.0 decompilation of `FUN_00100cb8` (_code @ 0x100cb8, 0x1a bytes) from smt4_v1.2.0.cxi.
 * build.py compiles it with the retail compiler and objdiff compares it with the retail bytes: remove this marker once it matches. */
#include "romwright_types.h"

extern "C" {

typedef int romwright_code(...);

void FUN_00100cb8(void)

{
  unsigned int unique0x10000039;
  char *pcVar1;
  
  for (pcVar1 = 
       "祄￼牀￼ゴ￼秨￼稐￼䆬￼ᥨ￼⦰￼僸￼ᦴ￼先￼谌￼稜￼鶼￼ꌄ￼蘼￼谤￼鍜￼ꀌ￼骤￼ꀰ￼欌￼稠￼傐￼谰￼爸￼᥄￼僘￼㕜￼㖄￼䅴￼㖨￼䆘￼欴￼㿘￼繬￼꤈￼㋸￼ဨ￼ꨄ￼烴￼╰￼䬜￼▔￼វ￼㌄￼❜￼ၜ￼꤄￼꤬￼꥔￼鳌￼㍀￼繐￼研￼羠￼䮔￼䀀￼諌￼焀￼䮰￼仄￼燐￼䗨￼犨￼狐￼稼￼僨￼ᅀ￼傴￼㖐￼薴￼ᣤ￼ᤌ￼㖬￼藐￼檴￼⣄￼㗨￼㘐￼䇼￼⣠￼僘￼ᤐ￼ᤸ￼ᥠ￼僴￼㘜￼檰￼᥼￼㘼￼爐￼⣠￼⤈￼⤰￼ᦐ￼缨￼牼￼ꩌ￼᦬￼済￼槸￼㒸￼䅴￼纰￼蔀￼㓔￼㹜￼紜￼ꣀ￼ᘼ￼䦄￼䦬￼垄￼相￼䧌￼垤￼ㆌ￼⎌￼⏠￼␈￼ະ￼䨈￼締￼໼￼ᚄ￼㊠￼寀￼㼐￼ᜤ￼➘￼ྼ￼ᝄ￼ꦀ￼㎈￼亐￼萬￼ᗼ￼㸌￼㖤￼菰￼鑌￼㰘￼䨌￼꣼￼㋘￼淠￼篼￼璔￼㰨￼漐￼囀￼ピ￼樄￼⢼￼㘬￼㙔￼孴￼෰￼♴￼ᘤ￼⛰￼໨￼㉤￼᷼￼—￼◔￼◼￼䵰￼絔￼絼￼᧌￼䥬￼㄰￼㷔￼㷼￼漀￼槐￼蒸￼䴘￼♌￼汀￼⊸￼囄￼䵜￼♤￼婼￼ᗤ￼㇔￼㹈￼嬜￼㉌￼ꡨ￼演￼▼￼㉨￼皌￼ᮔ￼脄￼Ʞ￼汌￼὘￼㓔￼㚌￼剀￼犨￼⠬￼꣄￼㚤￼䏌￼㜔￼㜼￼ᮄ￼䏨￼⩼￼ႀ￼㝔￼⪜￼⫝̸￼꣸￼ᮐ￼刨￼᮴￼ᯜ￼ႈ￼჈￼㞔￼⫼￼䏘￼⬠￼ჸ￼⭜￼㞨￼ᰜ￼᱄￼勀￼⯌￼犀￼⯰￼欬￼犠￼㠐￼勐￼爼￼䏄￼䏬￼䐔￼剤￼甸￼嘼￼鋄￼踈￼ꁴ￼颸￼踨￼ꍌ￼羬￼㞤￼⭈￼ᓰ￼妀￼⯀￼劬￼㡰￼ᆄ￼ᆬ￼ᴔ￼㢌￼ഔ￼㴴￼游￼䓬￼聬￼藐￼藸￼櫴￼凄￼劜￼⯔￼㢴￼⯸￼㣘￼労￼ꗜ￼ꓼ￼䔬￼勐￼䕐￼㣨￼ꠌ￼ഔ￼晐￼晸￼㴀￼⎨￼꒤￼㨈￼瓌￼䷐￼㏀￼㓜￼䍤￼樄￼䏨￼⭀￼䮤￼Ḍ￼厜￼䔨￼㤠￼ജ￼㵨￼䲼￼瘄￼ᜬ￼ី￼矜￼阨￼杄￼篘￼习￼螸￼亘￼矬￼㌰￼㺨￼舼￼ᠼ￼作￼果￼ඬ￼衠￼㐸￼ᣈ￼楘￼㛰￼ᲀ￼㡐￼觼￼飐￼㺘￼讨￼茔￼濬￼黈￼远￼硴￼附￼檀￼罤￼ꇼ￼鸘￼般￼ꈜ￼ꉄ￼鯨￼ꋄ￼ꎀ￼鮰￼ꋤ￼縸￼耤￼Ấ￼殐￼狤￼⯌￼吔￼檘￼驨￼┴￼ၠ￼ᄜ￼ॴ￼Ⲅ￼檨￼ᴸ￼磀￼Ḽ￼෈￼ᅘ￼䒬￼羨￼薐￼焔￼欐￼Ⲭ￼Ⳕ￼⳼￼㧌￼ᆈ￼㦘￼ࢴ￼঴￼煔￼ာ￼䏸￼缔￼蓔￼॰￼਀￼Ọ￼㢼￼䓌￼劤￼⯜￼ⰰ￼⪐￼ᄔ￼橌￼䒄￼㣄￼橸￼㡤￼剐￼ᅐ￼ꕄ￼獈￼達￼遼￼琘￼㰨￼鰔￼㱌￼䰈￼畔￼痐￼肀￼痴￼䰬￼蔬￼⡬￼ᨨ￼䆄￼ᩌ￼㳈￼蘜￼鷬￼般￼㵸￼粤￼ᝈ￼溴￼附￼杬￼㔐￼絔￼ᧀ￼銼￼澠￼䅬￼䈌￼飐￼讔￼陰￼讠￼记￼䈴￼诸￼荄￼᪼￼儤￼ᯌ￼揼￼蓐￼遰￼鮐￼肐￼稸￼浴￼鏴￼瘤￼驰￼穠￼ᙜ￼蠘￼窀￼麠￼貄￼鄈￼血￼鶰￼斨￼瘨￼ㆠ￼鱜￼酤￼鼸￼裨￼ꄌ￼鞘￼鐴￼鷬￼笈￼笰￼覘￼觀￼齌￼觴￼筐￼酨￼旄￼旬￼䳼￼癘￼鈄￼蹈￼紘￼ꌤ￼紨￼䯘￼汈￼ᔄ￼ᔬ￼蔰￼䱈￼磴￼甔￼沄￼讴￼蕄￼礌￼甬￼ᥬ￼ැ￼絀￼詄￼綼￼踘￼㝄￼謰￼瘬￼㜌￼່￼䢄￼比￼ጠ￼猐￼䫨￼镜￼馌￼竤￼馰￼新￼洈￼購￼髤￼渄￼駄￼ꁘ￼雰￼贐￼畬￼贴￼脌￼脴￼杠￼靀￼侌￼鰰￼閜￼韬￼〬￼搰￼阈￼螈￼罀￼迤￼讔￼诌￼礴￼蟘￼罔￼祤￼群￼錐￼谈￼翄￼鳐￼遘￼鼔￼鍠￼駼￼頄￼㬈￼摈￼讴￼祤￼䭼￼毀￼毨￼沌￼䯄￼规￼❀￼涄￼ᯬ￼䪨￼欘￼䫌￼ठ￼ै￼᠄￼ኘ￼㧼￼䧈￼㨈￼ዔ￼逐￼鳌￼㫸￼竸￼頔￼袼￼騬￼鴌￼髴￼阐￼豜￼瞰￼釘￼虀￼虰￼鮴￼霤￼銄￼搨￼镈￼旸￼襸￼什￼閠￼䬸￼鍸￼鲔￼颔￼Ⅴ￼"
      ; (int *)pcVar1 != (int *)0x42af30; unique0x10000039 = (int)pcVar1 + 4) {
    (*(romwright_code *)(*(int *)pcVar1 + (int)pcVar1))();
    pcVar1 = (char *)((int)pcVar1 + 4);
  }
  return;
}

} /* extern "C" */
